espressif/esp-idf/components/soc/esp32p4/include/soc/core1_interrupt_reg.h
/** CORE1_LP_EFUSE_INT_MAP_REG register
 *  NA
 */
#define CORE1_LP_EFUSE_INT_MAP_REG (DR_REG_CORE1_BASE + 0x44)
/** CORE1_CORE1_LP_EFUSE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_LP_EFUSE_INT_MAP    0x0000003FU
#define CORE1_CORE1_LP_EFUSE_INT_MAP_M  (CORE1_CORE1_LP_EFUSE_INT_MAP_V << CORE1_CORE1_LP_EFUSE_INT_MAP_S)
#define CORE1_CORE1_LP_EFUSE_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_LP_EFUSE_INT_MAP_S  0

/** CORE1_LP_SW_INT_MAP_REG register
 *  NA
 */
#define CORE1_LP_SW_INT_MAP_REG (DR_REG_CORE1_BASE + 0x48)
/** CORE1_CORE1_LP_SW_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_LP_SW_INT_MAP    0x0000003FU
#define CORE1_CORE1_LP_SW_INT_MAP_M  (CORE1_CORE1_LP_SW_INT_MAP_V << CORE1_CORE1_LP_SW_INT_MAP_S)
#define CORE1_CORE1_LP_SW_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_LP_SW_INT_MAP_S  0

/** CORE1_LP_SYSREG_INT_MAP_REG register
 *  NA
 */
#define CORE1_LP_SYSREG_INT_MAP_REG (DR_REG_CORE1_BASE + 0x4c)
/** CORE1_CORE1_LP_SYSREG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_LP_SYSREG_INT_MAP    0x0000003FU
#define CORE1_CORE1_LP_SYSREG_INT_MAP_M  (CORE1_CORE1_LP_SYSREG_INT_MAP_V << CORE1_CORE1_LP_SYSREG_INT_MAP_S)
#define CORE1_CORE1_LP_SYSREG_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_LP_SYSREG_INT_MAP_S  0

/** CORE1_LP_HUK_INT_MAP_REG register
 *  NA
 */
#define CORE1_LP_HUK_INT_MAP_REG (DR_REG_CORE1_BASE + 0x50)
/** CORE1_CORE1_LP_HUK_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_LP_HUK_INT_MAP    0x0000003FU
#define CORE1_CORE1_LP_HUK_INT_MAP_M  (CORE1_CORE1_LP_HUK_INT_MAP_V << CORE1_CORE1_LP_HUK_INT_MAP_S)
#define CORE1_CORE1_LP_HUK_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_LP_HUK_INT_MAP_S  0

/** CORE1_SYS_ICM_INT_MAP_REG register
 *  NA
 */
#define CORE1_SYS_ICM_INT_MAP_REG (DR_REG_CORE1_BASE + 0x54)
/** CORE1_CORE1_SYS_ICM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_SYS_ICM_INT_MAP    0x0000003FU
#define CORE1_CORE1_SYS_ICM_INT_MAP_M  (CORE1_CORE1_SYS_ICM_INT_MAP_V << CORE1_CORE1_SYS_ICM_INT_MAP_S)
#define CORE1_CORE1_SYS_ICM_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_SYS_ICM_INT_MAP_S  0

/** CORE1_USB_DEVICE_INT_MAP_REG register
 *  NA
 */
#define CORE1_USB_DEVICE_INT_MAP_REG (DR_REG_CORE1_BASE + 0x58)
/** CORE1_CORE1_USB_DEVICE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_USB_DEVICE_INT_MAP    0x0000003FU
#define CORE1_CORE1_USB_DEVICE_INT_MAP_M  (CORE1_CORE1_USB_DEVICE_INT_MAP_V << CORE1_CORE1_USB_DEVICE_INT_MAP_S)
#define CORE1_CORE1_USB_DEVICE_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_USB_DEVICE_INT_MAP_S  0

/** CORE1_SDIO_HOST_INT_MAP_REG register
 *  NA
 */
#define CORE1_SDIO_HOST_INT_MAP_REG (DR_REG_CORE1_BASE + 0x5c)
/** CORE1_CORE1_SDIO_HOST_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_SDIO_HOST_INT_MAP    0x0000003FU
#define CORE1_CORE1_SDIO_HOST_INT_MAP_M  (CORE1_CORE1_SDIO_HOST_INT_MAP_V << CORE1_CORE1_SDIO_HOST_INT_MAP_S)
#define CORE1_CORE1_SDIO_HOST_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_SDIO_HOST_INT_MAP_S  0

/** CORE1_GDMA_INT_MAP_REG register
 *  NA
 */
#define CORE1_GDMA_INT_MAP_REG (DR_REG_CORE1_BASE + 0x60)
/** CORE1_CORE1_GDMA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_GDMA_INT_MAP    0x0000003FU
#define CORE1_CORE1_GDMA_INT_MAP_M  (CORE1_CORE1_GDMA_INT_MAP_V << CORE1_CORE1_GDMA_INT_MAP_S)
#define CORE1_CORE1_GDMA_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_GDMA_INT_MAP_S  0

/** CORE1_SPI2_INT_MAP_REG register
 *  NA
 */
#define CORE1_SPI2_INT_MAP_REG (DR_REG_CORE1_BASE + 0x64)
/** CORE1_CORE1_SPI2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_SPI2_INT_MAP    0x0000003FU
#define CORE1_CORE1_SPI2_INT_MAP_M  (CORE1_CORE1_SPI2_INT_MAP_V << CORE1_CORE1_SPI2_INT_MAP_S)
#define CORE1_CORE1_SPI2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_SPI2_INT_MAP_S  0

/** CORE1_SPI3_INT_MAP_REG register
 *  NA
 */
#define CORE1_SPI3_INT_MAP_REG (DR_REG_CORE1_BASE + 0x68)
/** CORE1_CORE1_SPI3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_SPI3_INT_MAP    0x0000003FU
#define CORE1_CORE1_SPI3_INT_MAP_M  (CORE1_CORE1_SPI3_INT_MAP_V << CORE1_CORE1_SPI3_INT_MAP_S)
#define CORE1_CORE1_SPI3_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_SPI3_INT_MAP_S  0

/** CORE1_I2S0_INT_MAP_REG register
 *  NA
 */
#define CORE1_I2S0_INT_MAP_REG (DR_REG_CORE1_BASE + 0x6c)
/** CORE1_CORE1_I2S0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_I2S0_INT_MAP    0x0000003FU
#define CORE1_CORE1_I2S0_INT_MAP_M  (CORE1_CORE1_I2S0_INT_MAP_V << CORE1_CORE1_I2S0_INT_MAP_S)
#define CORE1_CORE1_I2S0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_I2S0_INT_MAP_S  0

/** CORE1_I2S1_INT_MAP_REG register
 *  NA
 */
#define CORE1_I2S1_INT_MAP_REG (DR_REG_CORE1_BASE + 0x70)
/** CORE1_CORE1_I2S1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_I2S1_INT_MAP    0x0000003FU
#define CORE1_CORE1_I2S1_INT_MAP_M  (CORE1_CORE1_I2S1_INT_MAP_V << CORE1_CORE1_I2S1_INT_MAP_S)
#define CORE1_CORE1_I2S1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_I2S1_INT_MAP_S  0

/** CORE1_I2S2_INT_MAP_REG register
 *  NA
 */
#define CORE1_I2S2_INT_MAP_REG (DR_REG_CORE1_BASE + 0x74)
/** CORE1_CORE1_I2S2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_I2S2_INT_MAP    0x0000003FU
#define CORE1_CORE1_I2S2_INT_MAP_M  (CORE1_CORE1_I2S2_INT_MAP_V << CORE1_CORE1_I2S2_INT_MAP_S)
#define CORE1_CORE1_I2S2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_I2S2_INT_MAP_S  0

/** CORE1_UHCI0_INT_MAP_REG register
 *  NA
 */
#define CORE1_UHCI0_INT_MAP_REG (DR_REG_CORE1_BASE + 0x78)
/** CORE1_CORE1_UHCI0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_UHCI0_INT_MAP    0x0000003FU
#define CORE1_CORE1_UHCI0_INT_MAP_M  (CORE1_CORE1_UHCI0_INT_MAP_V << CORE1_CORE1_UHCI0_INT_MAP_S)
#define CORE1_CORE1_UHCI0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_UHCI0_INT_MAP_S  0

/** CORE1_UART0_INT_MAP_REG register
 *  NA
 */
#define CORE1_UART0_INT_MAP_REG (DR_REG_CORE1_BASE + 0x7c)
/** CORE1_CORE1_UART0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_UART0_INT_MAP    0x0000003FU
#define CORE1_CORE1_UART0_INT_MAP_M  (CORE1_CORE1_UART0_INT_MAP_V << CORE1_CORE1_UART0_INT_MAP_S)
#define CORE1_CORE1_UART0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_UART0_INT_MAP_S  0

/** CORE1_UART1_INT_MAP_REG register
 *  NA
 */
#define CORE1_UART1_INT_MAP_REG (DR_REG_CORE1_BASE + 0x80)
/** CORE1_CORE1_UART1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_UART1_INT_MAP    0x0000003FU
#define CORE1_CORE1_UART1_INT_MAP_M  (CORE1_CORE1_UART1_INT_MAP_V << CORE1_CORE1_UART1_INT_MAP_S)
#define CORE1_CORE1_UART1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_UART1_INT_MAP_S  0

/** CORE1_UART2_INT_MAP_REG register
 *  NA
 */
#define CORE1_UART2_INT_MAP_REG (DR_REG_CORE1_BASE + 0x84)
/** CORE1_CORE1_UART2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_UART2_INT_MAP    0x0000003FU
#define CORE1_CORE1_UART2_INT_MAP_M  (CORE1_CORE1_UART2_INT_MAP_V << CORE1_CORE1_UART2_INT_MAP_S)
#define CORE1_CORE1_UART2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_UART2_INT_MAP_S  0

/** CORE1_UART3_INT_MAP_REG register
 *  NA
 */
#define CORE1_UART3_INT_MAP_REG (DR_REG_CORE1_BASE + 0x88)
/** CORE1_CORE1_UART3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_UART3_INT_MAP    0x0000003FU
#define CORE1_CORE1_UART3_INT_MAP_M  (CORE1_CORE1_UART3_INT_MAP_V << CORE1_CORE1_UART3_INT_MAP_S)
#define CORE1_CORE1_UART3_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_UART3_INT_MAP_S  0

/** CORE1_UART4_INT_MAP_REG register
 *  NA
 */
#define CORE1_UART4_INT_MAP_REG (DR_REG_CORE1_BASE + 0x8c)
/** CORE1_CORE1_UART4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_UART4_INT_MAP    0x0000003FU
#define CORE1_CORE1_UART4_INT_MAP_M  (CORE1_CORE1_UART4_INT_MAP_V << CORE1_CORE1_UART4_INT_MAP_S)
#define CORE1_CORE1_UART4_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_UART4_INT_MAP_S  0

/** CORE1_LCD_CAM_INT_MAP_REG register
 *  NA
 */
#define CORE1_LCD_CAM_INT_MAP_REG (DR_REG_CORE1_BASE + 0x90)
/** CORE1_CORE1_LCD_CAM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_LCD_CAM_INT_MAP    0x0000003FU
#define CORE1_CORE1_LCD_CAM_INT_MAP_M  (CORE1_CORE1_LCD_CAM_INT_MAP_V << CORE1_CORE1_LCD_CAM_INT_MAP_S)
#define CORE1_CORE1_LCD_CAM_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_LCD_CAM_INT_MAP_S  0

/** CORE1_ADC_INT_MAP_REG register
 *  NA
 */
#define CORE1_ADC_INT_MAP_REG (DR_REG_CORE1_BASE + 0x94)
/** CORE1_CORE1_ADC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_ADC_INT_MAP    0x0000003FU
#define CORE1_CORE1_ADC_INT_MAP_M  (CORE1_CORE1_ADC_INT_MAP_V << CORE1_CORE1_ADC_INT_MAP_S)
#define CORE1_CORE1_ADC_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_ADC_INT_MAP_S  0

/** CORE1_PWM0_INT_MAP_REG register
 *  NA
 */
#define CORE1_PWM0_INT_MAP_REG (DR_REG_CORE1_BASE + 0x98)
/** CORE1_CORE1_PWM0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_PWM0_INT_MAP    0x0000003FU
#define CORE1_CORE1_PWM0_INT_MAP_M  (CORE1_CORE1_PWM0_INT_MAP_V << CORE1_CORE1_PWM0_INT_MAP_S)
#define CORE1_CORE1_PWM0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_PWM0_INT_MAP_S  0

/** CORE1_PWM1_INT_MAP_REG register
 *  NA
 */
#define CORE1_PWM1_INT_MAP_REG (DR_REG_CORE1_BASE + 0x9c)
/** CORE1_CORE1_PWM1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_PWM1_INT_MAP    0x0000003FU
#define CORE1_CORE1_PWM1_INT_MAP_M  (CORE1_CORE1_PWM1_INT_MAP_V << CORE1_CORE1_PWM1_INT_MAP_S)
#define CORE1_CORE1_PWM1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_PWM1_INT_MAP_S  0

