espressif/esp-idf/components/soc/esp32p4/include/soc/core1_interrupt_reg.h
/** CORE1_CAN0_INT_MAP_REG register
 *  NA
 */
#define CORE1_CAN0_INT_MAP_REG (DR_REG_CORE1_BASE + 0xa0)
/** CORE1_CORE1_CAN0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CAN0_INT_MAP    0x0000003FU
#define CORE1_CORE1_CAN0_INT_MAP_M  (CORE1_CORE1_CAN0_INT_MAP_V << CORE1_CORE1_CAN0_INT_MAP_S)
#define CORE1_CORE1_CAN0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_CAN0_INT_MAP_S  0

/** CORE1_CAN1_INT_MAP_REG register
 *  NA
 */
#define CORE1_CAN1_INT_MAP_REG (DR_REG_CORE1_BASE + 0xa4)
/** CORE1_CORE1_CAN1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CAN1_INT_MAP    0x0000003FU
#define CORE1_CORE1_CAN1_INT_MAP_M  (CORE1_CORE1_CAN1_INT_MAP_V << CORE1_CORE1_CAN1_INT_MAP_S)
#define CORE1_CORE1_CAN1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_CAN1_INT_MAP_S  0

/** CORE1_CAN2_INT_MAP_REG register
 *  NA
 */
#define CORE1_CAN2_INT_MAP_REG (DR_REG_CORE1_BASE + 0xa8)
/** CORE1_CORE1_CAN2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CAN2_INT_MAP    0x0000003FU
#define CORE1_CORE1_CAN2_INT_MAP_M  (CORE1_CORE1_CAN2_INT_MAP_V << CORE1_CORE1_CAN2_INT_MAP_S)
#define CORE1_CORE1_CAN2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_CAN2_INT_MAP_S  0

/** CORE1_RMT_INT_MAP_REG register
 *  NA
 */
#define CORE1_RMT_INT_MAP_REG (DR_REG_CORE1_BASE + 0xac)
/** CORE1_CORE1_RMT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_RMT_INT_MAP    0x0000003FU
#define CORE1_CORE1_RMT_INT_MAP_M  (CORE1_CORE1_RMT_INT_MAP_V << CORE1_CORE1_RMT_INT_MAP_S)
#define CORE1_CORE1_RMT_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_RMT_INT_MAP_S  0

/** CORE1_I2C0_INT_MAP_REG register
 *  NA
 */
#define CORE1_I2C0_INT_MAP_REG (DR_REG_CORE1_BASE + 0xb0)
/** CORE1_CORE1_I2C0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_I2C0_INT_MAP    0x0000003FU
#define CORE1_CORE1_I2C0_INT_MAP_M  (CORE1_CORE1_I2C0_INT_MAP_V << CORE1_CORE1_I2C0_INT_MAP_S)
#define CORE1_CORE1_I2C0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_I2C0_INT_MAP_S  0

/** CORE1_I2C1_INT_MAP_REG register
 *  NA
 */
#define CORE1_I2C1_INT_MAP_REG (DR_REG_CORE1_BASE + 0xb4)
/** CORE1_CORE1_I2C1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_I2C1_INT_MAP    0x0000003FU
#define CORE1_CORE1_I2C1_INT_MAP_M  (CORE1_CORE1_I2C1_INT_MAP_V << CORE1_CORE1_I2C1_INT_MAP_S)
#define CORE1_CORE1_I2C1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_I2C1_INT_MAP_S  0

/** CORE1_TIMERGRP0_T0_INT_MAP_REG register
 *  NA
 */
#define CORE1_TIMERGRP0_T0_INT_MAP_REG (DR_REG_CORE1_BASE + 0xb8)
/** CORE1_CORE1_TIMERGRP0_T0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_TIMERGRP0_T0_INT_MAP    0x0000003FU
#define CORE1_CORE1_TIMERGRP0_T0_INT_MAP_M  (CORE1_CORE1_TIMERGRP0_T0_INT_MAP_V << CORE1_CORE1_TIMERGRP0_T0_INT_MAP_S)
#define CORE1_CORE1_TIMERGRP0_T0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_TIMERGRP0_T0_INT_MAP_S  0

/** CORE1_TIMERGRP0_T1_INT_MAP_REG register
 *  NA
 */
#define CORE1_TIMERGRP0_T1_INT_MAP_REG (DR_REG_CORE1_BASE + 0xbc)
/** CORE1_CORE1_TIMERGRP0_T1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_TIMERGRP0_T1_INT_MAP    0x0000003FU
#define CORE1_CORE1_TIMERGRP0_T1_INT_MAP_M  (CORE1_CORE1_TIMERGRP0_T1_INT_MAP_V << CORE1_CORE1_TIMERGRP0_T1_INT_MAP_S)
#define CORE1_CORE1_TIMERGRP0_T1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_TIMERGRP0_T1_INT_MAP_S  0

/** CORE1_TIMERGRP0_WDT_INT_MAP_REG register
 *  NA
 */
#define CORE1_TIMERGRP0_WDT_INT_MAP_REG (DR_REG_CORE1_BASE + 0xc0)
/** CORE1_CORE1_TIMERGRP0_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_TIMERGRP0_WDT_INT_MAP    0x0000003FU
#define CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_M  (CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_V << CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_S)
#define CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_TIMERGRP0_WDT_INT_MAP_S  0

/** CORE1_TIMERGRP1_T0_INT_MAP_REG register
 *  NA
 */
#define CORE1_TIMERGRP1_T0_INT_MAP_REG (DR_REG_CORE1_BASE + 0xc4)
/** CORE1_CORE1_TIMERGRP1_T0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_TIMERGRP1_T0_INT_MAP    0x0000003FU
#define CORE1_CORE1_TIMERGRP1_T0_INT_MAP_M  (CORE1_CORE1_TIMERGRP1_T0_INT_MAP_V << CORE1_CORE1_TIMERGRP1_T0_INT_MAP_S)
#define CORE1_CORE1_TIMERGRP1_T0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_TIMERGRP1_T0_INT_MAP_S  0

/** CORE1_TIMERGRP1_T1_INT_MAP_REG register
 *  NA
 */
#define CORE1_TIMERGRP1_T1_INT_MAP_REG (DR_REG_CORE1_BASE + 0xc8)
/** CORE1_CORE1_TIMERGRP1_T1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_TIMERGRP1_T1_INT_MAP    0x0000003FU
#define CORE1_CORE1_TIMERGRP1_T1_INT_MAP_M  (CORE1_CORE1_TIMERGRP1_T1_INT_MAP_V << CORE1_CORE1_TIMERGRP1_T1_INT_MAP_S)
#define CORE1_CORE1_TIMERGRP1_T1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_TIMERGRP1_T1_INT_MAP_S  0

/** CORE1_TIMERGRP1_WDT_INT_MAP_REG register
 *  NA
 */
#define CORE1_TIMERGRP1_WDT_INT_MAP_REG (DR_REG_CORE1_BASE + 0xcc)
/** CORE1_CORE1_TIMERGRP1_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_TIMERGRP1_WDT_INT_MAP    0x0000003FU
#define CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_M  (CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_V << CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_S)
#define CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_TIMERGRP1_WDT_INT_MAP_S  0

/** CORE1_LEDC_INT_MAP_REG register
 *  NA
 */
#define CORE1_LEDC_INT_MAP_REG (DR_REG_CORE1_BASE + 0xd0)
/** CORE1_CORE1_LEDC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_LEDC_INT_MAP    0x0000003FU
#define CORE1_CORE1_LEDC_INT_MAP_M  (CORE1_CORE1_LEDC_INT_MAP_V << CORE1_CORE1_LEDC_INT_MAP_S)
#define CORE1_CORE1_LEDC_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_LEDC_INT_MAP_S  0

/** CORE1_SYSTIMER_TARGET0_INT_MAP_REG register
 *  NA
 */
#define CORE1_SYSTIMER_TARGET0_INT_MAP_REG (DR_REG_CORE1_BASE + 0xd4)
/** CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP    0x0000003FU
#define CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_M  (CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_V << CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_S)
#define CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_SYSTIMER_TARGET0_INT_MAP_S  0

/** CORE1_SYSTIMER_TARGET1_INT_MAP_REG register
 *  NA
 */
#define CORE1_SYSTIMER_TARGET1_INT_MAP_REG (DR_REG_CORE1_BASE + 0xd8)
/** CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP    0x0000003FU
#define CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_M  (CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_V << CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_S)
#define CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_SYSTIMER_TARGET1_INT_MAP_S  0

/** CORE1_SYSTIMER_TARGET2_INT_MAP_REG register
 *  NA
 */
#define CORE1_SYSTIMER_TARGET2_INT_MAP_REG (DR_REG_CORE1_BASE + 0xdc)
/** CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP    0x0000003FU
#define CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_M  (CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_V << CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_S)
#define CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_SYSTIMER_TARGET2_INT_MAP_S  0

/** CORE1_AHB_PDMA_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE1_AHB_PDMA_IN_CH0_INT_MAP_REG (DR_REG_CORE1_BASE + 0xe0)
/** CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP    0x0000003FU
#define CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_V << CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_S)
#define CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AHB_PDMA_IN_CH0_INT_MAP_S  0

/** CORE1_AHB_PDMA_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE1_AHB_PDMA_IN_CH1_INT_MAP_REG (DR_REG_CORE1_BASE + 0xe4)
/** CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP    0x0000003FU
#define CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_V << CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_S)
#define CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AHB_PDMA_IN_CH1_INT_MAP_S  0

/** CORE1_AHB_PDMA_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE1_AHB_PDMA_IN_CH2_INT_MAP_REG (DR_REG_CORE1_BASE + 0xe8)
/** CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP    0x0000003FU
#define CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_V << CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_S)
#define CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AHB_PDMA_IN_CH2_INT_MAP_S  0

/** CORE1_AHB_PDMA_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE1_AHB_PDMA_OUT_CH0_INT_MAP_REG (DR_REG_CORE1_BASE + 0xec)
/** CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP    0x0000003FU
#define CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_V << CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_S)
#define CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AHB_PDMA_OUT_CH0_INT_MAP_S  0

/** CORE1_AHB_PDMA_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE1_AHB_PDMA_OUT_CH1_INT_MAP_REG (DR_REG_CORE1_BASE + 0xf0)
/** CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP    0x0000003FU
#define CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_V << CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_S)
#define CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AHB_PDMA_OUT_CH1_INT_MAP_S  0

/** CORE1_AHB_PDMA_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE1_AHB_PDMA_OUT_CH2_INT_MAP_REG (DR_REG_CORE1_BASE + 0xf4)
/** CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP    0x0000003FU
#define CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_M  (CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_V << CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_S)
#define CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AHB_PDMA_OUT_CH2_INT_MAP_S  0

/** CORE1_AXI_PDMA_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE1_AXI_PDMA_IN_CH0_INT_MAP_REG (DR_REG_CORE1_BASE + 0xf8)
/** CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP    0x0000003FU
#define CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_V << CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_S)
#define CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AXI_PDMA_IN_CH0_INT_MAP_S  0

/** CORE1_AXI_PDMA_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE1_AXI_PDMA_IN_CH1_INT_MAP_REG (DR_REG_CORE1_BASE + 0xfc)
/** CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP    0x0000003FU
#define CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_V << CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_S)
#define CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AXI_PDMA_IN_CH1_INT_MAP_S  0

/** CORE1_AXI_PDMA_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE1_AXI_PDMA_IN_CH2_INT_MAP_REG (DR_REG_CORE1_BASE + 0x100)
/** CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP    0x0000003FU
#define CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_V << CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_S)
#define CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AXI_PDMA_IN_CH2_INT_MAP_S  0

/** CORE1_AXI_PDMA_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE1_AXI_PDMA_OUT_CH0_INT_MAP_REG (DR_REG_CORE1_BASE + 0x104)
/** CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP    0x0000003FU
#define CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_V << CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_S)
#define CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AXI_PDMA_OUT_CH0_INT_MAP_S  0

/** CORE1_AXI_PDMA_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE1_AXI_PDMA_OUT_CH1_INT_MAP_REG (DR_REG_CORE1_BASE + 0x108)
/** CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP    0x0000003FU
#define CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_V << CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_S)
#define CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AXI_PDMA_OUT_CH1_INT_MAP_S  0

/** CORE1_AXI_PDMA_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE1_AXI_PDMA_OUT_CH2_INT_MAP_REG (DR_REG_CORE1_BASE + 0x10c)
/** CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP    0x0000003FU
#define CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_M  (CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_V << CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_S)
#define CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AXI_PDMA_OUT_CH2_INT_MAP_S  0

/** CORE1_RSA_INT_MAP_REG register
 *  NA
 */
#define CORE1_RSA_INT_MAP_REG (DR_REG_CORE1_BASE + 0x110)
/** CORE1_CORE1_RSA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_RSA_INT_MAP    0x0000003FU
#define CORE1_CORE1_RSA_INT_MAP_M  (CORE1_CORE1_RSA_INT_MAP_V << CORE1_CORE1_RSA_INT_MAP_S)
#define CORE1_CORE1_RSA_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_RSA_INT_MAP_S  0

/** CORE1_AES_INT_MAP_REG register
 *  NA
 */
#define CORE1_AES_INT_MAP_REG (DR_REG_CORE1_BASE + 0x114)
/** CORE1_CORE1_AES_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_AES_INT_MAP    0x0000003FU
#define CORE1_CORE1_AES_INT_MAP_M  (CORE1_CORE1_AES_INT_MAP_V << CORE1_CORE1_AES_INT_MAP_S)
#define CORE1_CORE1_AES_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_AES_INT_MAP_S  0

/** CORE1_SHA_INT_MAP_REG register
 *  NA
 */
#define CORE1_SHA_INT_MAP_REG (DR_REG_CORE1_BASE + 0x118)
/** CORE1_CORE1_SHA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_SHA_INT_MAP    0x0000003FU
#define CORE1_CORE1_SHA_INT_MAP_M  (CORE1_CORE1_SHA_INT_MAP_V << CORE1_CORE1_SHA_INT_MAP_S)
#define CORE1_CORE1_SHA_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_SHA_INT_MAP_S  0

/** CORE1_ECC_INT_MAP_REG register
 *  NA
 */
#define CORE1_ECC_INT_MAP_REG (DR_REG_CORE1_BASE + 0x11c)
/** CORE1_CORE1_ECC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_ECC_INT_MAP    0x0000003FU
#define CORE1_CORE1_ECC_INT_MAP_M  (CORE1_CORE1_ECC_INT_MAP_V << CORE1_CORE1_ECC_INT_MAP_S)
#define CORE1_CORE1_ECC_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_ECC_INT_MAP_S  0

/** CORE1_ECDSA_INT_MAP_REG register
 *  NA
 */
#define CORE1_ECDSA_INT_MAP_REG (DR_REG_CORE1_BASE + 0x120)
/** CORE1_CORE1_ECDSA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_ECDSA_INT_MAP    0x0000003FU
#define CORE1_CORE1_ECDSA_INT_MAP_M  (CORE1_CORE1_ECDSA_INT_MAP_V << CORE1_CORE1_ECDSA_INT_MAP_S)
#define CORE1_CORE1_ECDSA_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_ECDSA_INT_MAP_S  0

/** CORE1_KM_INT_MAP_REG register
 *  NA
 */
#define CORE1_KM_INT_MAP_REG (DR_REG_CORE1_BASE + 0x124)
/** CORE1_CORE1_KM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_KM_INT_MAP    0x0000003FU
#define CORE1_CORE1_KM_INT_MAP_M  (CORE1_CORE1_KM_INT_MAP_V << CORE1_CORE1_KM_INT_MAP_S)
#define CORE1_CORE1_KM_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_KM_INT_MAP_S  0

/** CORE1_GPIO_INT0_MAP_REG register
 *  NA
 */
#define CORE1_GPIO_INT0_MAP_REG (DR_REG_CORE1_BASE + 0x128)
/** CORE1_CORE1_GPIO_INT0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_GPIO_INT0_MAP    0x0000003FU
#define CORE1_CORE1_GPIO_INT0_MAP_M  (CORE1_CORE1_GPIO_INT0_MAP_V << CORE1_CORE1_GPIO_INT0_MAP_S)
#define CORE1_CORE1_GPIO_INT0_MAP_V  0x0000003FU
#define CORE1_CORE1_GPIO_INT0_MAP_S  0

/** CORE1_GPIO_INT1_MAP_REG register
 *  NA
 */
#define CORE1_GPIO_INT1_MAP_REG (DR_REG_CORE1_BASE + 0x12c)
/** CORE1_CORE1_GPIO_INT1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_GPIO_INT1_MAP    0x0000003FU
#define CORE1_CORE1_GPIO_INT1_MAP_M  (CORE1_CORE1_GPIO_INT1_MAP_V << CORE1_CORE1_GPIO_INT1_MAP_S)
#define CORE1_CORE1_GPIO_INT1_MAP_V  0x0000003FU
#define CORE1_CORE1_GPIO_INT1_MAP_S  0

