espressif/esp-idf/components/soc/esp32p4/include/soc/core1_interrupt_reg.h
/** CORE1_GPIO_INT2_MAP_REG register
 *  NA
 */
#define CORE1_GPIO_INT2_MAP_REG (DR_REG_CORE1_BASE + 0x130)
/** CORE1_CORE1_GPIO_INT2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_GPIO_INT2_MAP    0x0000003FU
#define CORE1_CORE1_GPIO_INT2_MAP_M  (CORE1_CORE1_GPIO_INT2_MAP_V << CORE1_CORE1_GPIO_INT2_MAP_S)
#define CORE1_CORE1_GPIO_INT2_MAP_V  0x0000003FU
#define CORE1_CORE1_GPIO_INT2_MAP_S  0

/** CORE1_GPIO_INT3_MAP_REG register
 *  NA
 */
#define CORE1_GPIO_INT3_MAP_REG (DR_REG_CORE1_BASE + 0x134)
/** CORE1_CORE1_GPIO_INT3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_GPIO_INT3_MAP    0x0000003FU
#define CORE1_CORE1_GPIO_INT3_MAP_M  (CORE1_CORE1_GPIO_INT3_MAP_V << CORE1_CORE1_GPIO_INT3_MAP_S)
#define CORE1_CORE1_GPIO_INT3_MAP_V  0x0000003FU
#define CORE1_CORE1_GPIO_INT3_MAP_S  0

/** CORE1_GPIO_PAD_COMP_INT_MAP_REG register
 *  NA
 */
#define CORE1_GPIO_PAD_COMP_INT_MAP_REG (DR_REG_CORE1_BASE + 0x138)
/** CORE1_CORE1_GPIO_PAD_COMP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_GPIO_PAD_COMP_INT_MAP    0x0000003FU
#define CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_M  (CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_V << CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_S)
#define CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_GPIO_PAD_COMP_INT_MAP_S  0

/** CORE1_CPU_INT_FROM_CPU_0_MAP_REG register
 *  NA
 */
#define CORE1_CPU_INT_FROM_CPU_0_MAP_REG (DR_REG_CORE1_BASE + 0x13c)
/** CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP    0x0000003FU
#define CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_M  (CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_V << CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_S)
#define CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_V  0x0000003FU
#define CORE1_CORE1_CPU_INT_FROM_CPU_0_MAP_S  0

/** CORE1_CPU_INT_FROM_CPU_1_MAP_REG register
 *  NA
 */
#define CORE1_CPU_INT_FROM_CPU_1_MAP_REG (DR_REG_CORE1_BASE + 0x140)
/** CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP    0x0000003FU
#define CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_M  (CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_V << CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_S)
#define CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_V  0x0000003FU
#define CORE1_CORE1_CPU_INT_FROM_CPU_1_MAP_S  0

/** CORE1_CPU_INT_FROM_CPU_2_MAP_REG register
 *  NA
 */
#define CORE1_CPU_INT_FROM_CPU_2_MAP_REG (DR_REG_CORE1_BASE + 0x144)
/** CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP    0x0000003FU
#define CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_M  (CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_V << CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_S)
#define CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_V  0x0000003FU
#define CORE1_CORE1_CPU_INT_FROM_CPU_2_MAP_S  0

/** CORE1_CPU_INT_FROM_CPU_3_MAP_REG register
 *  NA
 */
#define CORE1_CPU_INT_FROM_CPU_3_MAP_REG (DR_REG_CORE1_BASE + 0x148)
/** CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP    0x0000003FU
#define CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_M  (CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_V << CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_S)
#define CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_V  0x0000003FU
#define CORE1_CORE1_CPU_INT_FROM_CPU_3_MAP_S  0

/** CORE1_CACHE_INT_MAP_REG register
 *  NA
 */
#define CORE1_CACHE_INT_MAP_REG (DR_REG_CORE1_BASE + 0x14c)
/** CORE1_CORE1_CACHE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CACHE_INT_MAP    0x0000003FU
#define CORE1_CORE1_CACHE_INT_MAP_M  (CORE1_CORE1_CACHE_INT_MAP_V << CORE1_CORE1_CACHE_INT_MAP_S)
#define CORE1_CORE1_CACHE_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_CACHE_INT_MAP_S  0

/** CORE1_FLASH_MSPI_INT_MAP_REG register
 *  NA
 */
#define CORE1_FLASH_MSPI_INT_MAP_REG (DR_REG_CORE1_BASE + 0x150)
/** CORE1_CORE1_FLASH_MSPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_FLASH_MSPI_INT_MAP    0x0000003FU
#define CORE1_CORE1_FLASH_MSPI_INT_MAP_M  (CORE1_CORE1_FLASH_MSPI_INT_MAP_V << CORE1_CORE1_FLASH_MSPI_INT_MAP_S)
#define CORE1_CORE1_FLASH_MSPI_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_FLASH_MSPI_INT_MAP_S  0

/** CORE1_CSI_BRIDGE_INT_MAP_REG register
 *  NA
 */
#define CORE1_CSI_BRIDGE_INT_MAP_REG (DR_REG_CORE1_BASE + 0x154)
/** CORE1_CORE1_CSI_BRIDGE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CSI_BRIDGE_INT_MAP    0x0000003FU
#define CORE1_CORE1_CSI_BRIDGE_INT_MAP_M  (CORE1_CORE1_CSI_BRIDGE_INT_MAP_V << CORE1_CORE1_CSI_BRIDGE_INT_MAP_S)
#define CORE1_CORE1_CSI_BRIDGE_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_CSI_BRIDGE_INT_MAP_S  0

/** CORE1_DSI_BRIDGE_INT_MAP_REG register
 *  NA
 */
#define CORE1_DSI_BRIDGE_INT_MAP_REG (DR_REG_CORE1_BASE + 0x158)
/** CORE1_CORE1_DSI_BRIDGE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_DSI_BRIDGE_INT_MAP    0x0000003FU
#define CORE1_CORE1_DSI_BRIDGE_INT_MAP_M  (CORE1_CORE1_DSI_BRIDGE_INT_MAP_V << CORE1_CORE1_DSI_BRIDGE_INT_MAP_S)
#define CORE1_CORE1_DSI_BRIDGE_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_DSI_BRIDGE_INT_MAP_S  0

/** CORE1_CSI_INT_MAP_REG register
 *  NA
 */
#define CORE1_CSI_INT_MAP_REG (DR_REG_CORE1_BASE + 0x15c)
/** CORE1_CORE1_CSI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CSI_INT_MAP    0x0000003FU
#define CORE1_CORE1_CSI_INT_MAP_M  (CORE1_CORE1_CSI_INT_MAP_V << CORE1_CORE1_CSI_INT_MAP_S)
#define CORE1_CORE1_CSI_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_CSI_INT_MAP_S  0

/** CORE1_DSI_INT_MAP_REG register
 *  NA
 */
#define CORE1_DSI_INT_MAP_REG (DR_REG_CORE1_BASE + 0x160)
/** CORE1_CORE1_DSI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_DSI_INT_MAP    0x0000003FU
#define CORE1_CORE1_DSI_INT_MAP_M  (CORE1_CORE1_DSI_INT_MAP_V << CORE1_CORE1_DSI_INT_MAP_S)
#define CORE1_CORE1_DSI_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_DSI_INT_MAP_S  0

/** CORE1_GMII_PHY_INT_MAP_REG register
 *  NA
 */
#define CORE1_GMII_PHY_INT_MAP_REG (DR_REG_CORE1_BASE + 0x164)
/** CORE1_CORE1_GMII_PHY_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_GMII_PHY_INT_MAP    0x0000003FU
#define CORE1_CORE1_GMII_PHY_INT_MAP_M  (CORE1_CORE1_GMII_PHY_INT_MAP_V << CORE1_CORE1_GMII_PHY_INT_MAP_S)
#define CORE1_CORE1_GMII_PHY_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_GMII_PHY_INT_MAP_S  0

/** CORE1_LPI_INT_MAP_REG register
 *  NA
 */
#define CORE1_LPI_INT_MAP_REG (DR_REG_CORE1_BASE + 0x168)
/** CORE1_CORE1_LPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_LPI_INT_MAP    0x0000003FU
#define CORE1_CORE1_LPI_INT_MAP_M  (CORE1_CORE1_LPI_INT_MAP_V << CORE1_CORE1_LPI_INT_MAP_S)
#define CORE1_CORE1_LPI_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_LPI_INT_MAP_S  0

/** CORE1_PMT_INT_MAP_REG register
 *  NA
 */
#define CORE1_PMT_INT_MAP_REG (DR_REG_CORE1_BASE + 0x16c)
/** CORE1_CORE1_PMT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_PMT_INT_MAP    0x0000003FU
#define CORE1_CORE1_PMT_INT_MAP_M  (CORE1_CORE1_PMT_INT_MAP_V << CORE1_CORE1_PMT_INT_MAP_S)
#define CORE1_CORE1_PMT_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_PMT_INT_MAP_S  0

/** CORE1_SBD_INT_MAP_REG register
 *  NA
 */
#define CORE1_SBD_INT_MAP_REG (DR_REG_CORE1_BASE + 0x170)
/** CORE1_CORE1_SBD_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_SBD_INT_MAP    0x0000003FU
#define CORE1_CORE1_SBD_INT_MAP_M  (CORE1_CORE1_SBD_INT_MAP_V << CORE1_CORE1_SBD_INT_MAP_S)
#define CORE1_CORE1_SBD_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_SBD_INT_MAP_S  0

/** CORE1_USB_OTG_INT_MAP_REG register
 *  NA
 */
#define CORE1_USB_OTG_INT_MAP_REG (DR_REG_CORE1_BASE + 0x174)
/** CORE1_CORE1_USB_OTG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_USB_OTG_INT_MAP    0x0000003FU
#define CORE1_CORE1_USB_OTG_INT_MAP_M  (CORE1_CORE1_USB_OTG_INT_MAP_V << CORE1_CORE1_USB_OTG_INT_MAP_S)
#define CORE1_CORE1_USB_OTG_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_USB_OTG_INT_MAP_S  0

