espressif/esp-idf/components/soc/esp32p4/include/soc/core1_interrupt_reg.h
/** CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_REG register
 *  NA
 */
#define CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_REG (DR_REG_CORE1_BASE + 0x178)
/** CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP    0x0000003FU
#define CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_M  (CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V << CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S)
#define CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S  0

/** CORE1_JPEG_INT_MAP_REG register
 *  NA
 */
#define CORE1_JPEG_INT_MAP_REG (DR_REG_CORE1_BASE + 0x17c)
/** CORE1_CORE1_JPEG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_JPEG_INT_MAP    0x0000003FU
#define CORE1_CORE1_JPEG_INT_MAP_M  (CORE1_CORE1_JPEG_INT_MAP_V << CORE1_CORE1_JPEG_INT_MAP_S)
#define CORE1_CORE1_JPEG_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_JPEG_INT_MAP_S  0

/** CORE1_PPA_INT_MAP_REG register
 *  NA
 */
#define CORE1_PPA_INT_MAP_REG (DR_REG_CORE1_BASE + 0x180)
/** CORE1_CORE1_PPA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_PPA_INT_MAP    0x0000003FU
#define CORE1_CORE1_PPA_INT_MAP_M  (CORE1_CORE1_PPA_INT_MAP_V << CORE1_CORE1_PPA_INT_MAP_S)
#define CORE1_CORE1_PPA_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_PPA_INT_MAP_S  0

/** CORE1_CORE0_TRACE_INT_MAP_REG register
 *  NA
 */
#define CORE1_CORE0_TRACE_INT_MAP_REG (DR_REG_CORE1_BASE + 0x184)
/** CORE1_CORE1_CORE0_TRACE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CORE0_TRACE_INT_MAP    0x0000003FU
#define CORE1_CORE1_CORE0_TRACE_INT_MAP_M  (CORE1_CORE1_CORE0_TRACE_INT_MAP_V << CORE1_CORE1_CORE0_TRACE_INT_MAP_S)
#define CORE1_CORE1_CORE0_TRACE_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_CORE0_TRACE_INT_MAP_S  0

/** CORE1_CORE1_TRACE_INT_MAP_REG register
 *  NA
 */
#define CORE1_CORE1_TRACE_INT_MAP_REG (DR_REG_CORE1_BASE + 0x188)
/** CORE1_CORE1_CORE1_TRACE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_CORE1_TRACE_INT_MAP    0x0000003FU
#define CORE1_CORE1_CORE1_TRACE_INT_MAP_M  (CORE1_CORE1_CORE1_TRACE_INT_MAP_V << CORE1_CORE1_CORE1_TRACE_INT_MAP_S)
#define CORE1_CORE1_CORE1_TRACE_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_CORE1_TRACE_INT_MAP_S  0

/** CORE1_HP_CORE_CTRL_INT_MAP_REG register
 *  NA
 */
#define CORE1_HP_CORE_CTRL_INT_MAP_REG (DR_REG_CORE1_BASE + 0x18c)
/** CORE1_CORE1_HP_CORE_CTRL_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_HP_CORE_CTRL_INT_MAP    0x0000003FU
#define CORE1_CORE1_HP_CORE_CTRL_INT_MAP_M  (CORE1_CORE1_HP_CORE_CTRL_INT_MAP_V << CORE1_CORE1_HP_CORE_CTRL_INT_MAP_S)
#define CORE1_CORE1_HP_CORE_CTRL_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_HP_CORE_CTRL_INT_MAP_S  0

/** CORE1_ISP_INT_MAP_REG register
 *  NA
 */
#define CORE1_ISP_INT_MAP_REG (DR_REG_CORE1_BASE + 0x190)
/** CORE1_CORE1_ISP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_ISP_INT_MAP    0x0000003FU
#define CORE1_CORE1_ISP_INT_MAP_M  (CORE1_CORE1_ISP_INT_MAP_V << CORE1_CORE1_ISP_INT_MAP_S)
#define CORE1_CORE1_ISP_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_ISP_INT_MAP_S  0

/** CORE1_I3C_MST_INT_MAP_REG register
 *  NA
 */
#define CORE1_I3C_MST_INT_MAP_REG (DR_REG_CORE1_BASE + 0x194)
/** CORE1_CORE1_I3C_MST_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_I3C_MST_INT_MAP    0x0000003FU
#define CORE1_CORE1_I3C_MST_INT_MAP_M  (CORE1_CORE1_I3C_MST_INT_MAP_V << CORE1_CORE1_I3C_MST_INT_MAP_S)
#define CORE1_CORE1_I3C_MST_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_I3C_MST_INT_MAP_S  0

/** CORE1_I3C_SLV_INT_MAP_REG register
 *  NA
 */
#define CORE1_I3C_SLV_INT_MAP_REG (DR_REG_CORE1_BASE + 0x198)
/** CORE1_CORE1_I3C_SLV_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_I3C_SLV_INT_MAP    0x0000003FU
#define CORE1_CORE1_I3C_SLV_INT_MAP_M  (CORE1_CORE1_I3C_SLV_INT_MAP_V << CORE1_CORE1_I3C_SLV_INT_MAP_S)
#define CORE1_CORE1_I3C_SLV_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_I3C_SLV_INT_MAP_S  0

/** CORE1_USB_OTG11_INT_MAP_REG register
 *  NA
 */
#define CORE1_USB_OTG11_INT_MAP_REG (DR_REG_CORE1_BASE + 0x19c)
/** CORE1_CORE1_USB_OTG11_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_USB_OTG11_INT_MAP    0x0000003FU
#define CORE1_CORE1_USB_OTG11_INT_MAP_M  (CORE1_CORE1_USB_OTG11_INT_MAP_V << CORE1_CORE1_USB_OTG11_INT_MAP_S)
#define CORE1_CORE1_USB_OTG11_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_USB_OTG11_INT_MAP_S  0

/** CORE1_DMA2D_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE1_DMA2D_IN_CH0_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1a0)
/** CORE1_CORE1_DMA2D_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_DMA2D_IN_CH0_INT_MAP    0x0000003FU
#define CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_M  (CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_V << CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_S)
#define CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_DMA2D_IN_CH0_INT_MAP_S  0

/** CORE1_DMA2D_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE1_DMA2D_IN_CH1_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1a4)
/** CORE1_CORE1_DMA2D_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_DMA2D_IN_CH1_INT_MAP    0x0000003FU
#define CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_M  (CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_V << CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_S)
#define CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_DMA2D_IN_CH1_INT_MAP_S  0

/** CORE1_DMA2D_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE1_DMA2D_OUT_CH0_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1a8)
/** CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP    0x0000003FU
#define CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_M  (CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_V << CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_S)
#define CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_DMA2D_OUT_CH0_INT_MAP_S  0

/** CORE1_DMA2D_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE1_DMA2D_OUT_CH1_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1ac)
/** CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP    0x0000003FU
#define CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_M  (CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_V << CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_S)
#define CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_DMA2D_OUT_CH1_INT_MAP_S  0

/** CORE1_DMA2D_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE1_DMA2D_OUT_CH2_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1b0)
/** CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP    0x0000003FU
#define CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_M  (CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_V << CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_S)
#define CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_DMA2D_OUT_CH2_INT_MAP_S  0

/** CORE1_PSRAM_MSPI_INT_MAP_REG register
 *  NA
 */
#define CORE1_PSRAM_MSPI_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1b4)
/** CORE1_CORE1_PSRAM_MSPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_PSRAM_MSPI_INT_MAP    0x0000003FU
#define CORE1_CORE1_PSRAM_MSPI_INT_MAP_M  (CORE1_CORE1_PSRAM_MSPI_INT_MAP_V << CORE1_CORE1_PSRAM_MSPI_INT_MAP_S)
#define CORE1_CORE1_PSRAM_MSPI_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_PSRAM_MSPI_INT_MAP_S  0

