espressif/esp-idf/components/soc/esp32p4/include/soc/core1_interrupt_reg.h
/** CORE1_HP_SYSREG_INT_MAP_REG register
 *  NA
 */
#define CORE1_HP_SYSREG_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1b8)
/** CORE1_CORE1_HP_SYSREG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_HP_SYSREG_INT_MAP    0x0000003FU
#define CORE1_CORE1_HP_SYSREG_INT_MAP_M  (CORE1_CORE1_HP_SYSREG_INT_MAP_V << CORE1_CORE1_HP_SYSREG_INT_MAP_S)
#define CORE1_CORE1_HP_SYSREG_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_HP_SYSREG_INT_MAP_S  0

/** CORE1_PCNT_INT_MAP_REG register
 *  NA
 */
#define CORE1_PCNT_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1bc)
/** CORE1_CORE1_PCNT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_PCNT_INT_MAP    0x0000003FU
#define CORE1_CORE1_PCNT_INT_MAP_M  (CORE1_CORE1_PCNT_INT_MAP_V << CORE1_CORE1_PCNT_INT_MAP_S)
#define CORE1_CORE1_PCNT_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_PCNT_INT_MAP_S  0

/** CORE1_HP_PAU_INT_MAP_REG register
 *  NA
 */
#define CORE1_HP_PAU_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1c0)
/** CORE1_CORE1_HP_PAU_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_HP_PAU_INT_MAP    0x0000003FU
#define CORE1_CORE1_HP_PAU_INT_MAP_M  (CORE1_CORE1_HP_PAU_INT_MAP_V << CORE1_CORE1_HP_PAU_INT_MAP_S)
#define CORE1_CORE1_HP_PAU_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_HP_PAU_INT_MAP_S  0

/** CORE1_HP_PARLIO_RX_INT_MAP_REG register
 *  NA
 */
#define CORE1_HP_PARLIO_RX_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1c4)
/** CORE1_CORE1_HP_PARLIO_RX_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_HP_PARLIO_RX_INT_MAP    0x0000003FU
#define CORE1_CORE1_HP_PARLIO_RX_INT_MAP_M  (CORE1_CORE1_HP_PARLIO_RX_INT_MAP_V << CORE1_CORE1_HP_PARLIO_RX_INT_MAP_S)
#define CORE1_CORE1_HP_PARLIO_RX_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_HP_PARLIO_RX_INT_MAP_S  0

/** CORE1_HP_PARLIO_TX_INT_MAP_REG register
 *  NA
 */
#define CORE1_HP_PARLIO_TX_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1c8)
/** CORE1_CORE1_HP_PARLIO_TX_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_HP_PARLIO_TX_INT_MAP    0x0000003FU
#define CORE1_CORE1_HP_PARLIO_TX_INT_MAP_M  (CORE1_CORE1_HP_PARLIO_TX_INT_MAP_V << CORE1_CORE1_HP_PARLIO_TX_INT_MAP_S)
#define CORE1_CORE1_HP_PARLIO_TX_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_HP_PARLIO_TX_INT_MAP_S  0

/** CORE1_H264_DMA2D_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_OUT_CH0_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1cc)
/** CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH0_INT_MAP_S  0

/** CORE1_H264_DMA2D_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_OUT_CH1_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1d0)
/** CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH1_INT_MAP_S  0

/** CORE1_H264_DMA2D_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_OUT_CH2_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1d4)
/** CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH2_INT_MAP_S  0

/** CORE1_H264_DMA2D_OUT_CH3_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_OUT_CH3_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1d8)
/** CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH3_INT_MAP_S  0

/** CORE1_H264_DMA2D_OUT_CH4_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_OUT_CH4_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1dc)
/** CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_V << CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_OUT_CH4_INT_MAP_S  0

/** CORE1_H264_DMA2D_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_IN_CH0_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1e0)
/** CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH0_INT_MAP_S  0

/** CORE1_H264_DMA2D_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_IN_CH1_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1e4)
/** CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH1_INT_MAP_S  0

/** CORE1_H264_DMA2D_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_IN_CH2_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1e8)
/** CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH2_INT_MAP_S  0

/** CORE1_H264_DMA2D_IN_CH3_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_IN_CH3_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1ec)
/** CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH3_INT_MAP_S  0

/** CORE1_H264_DMA2D_IN_CH4_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_IN_CH4_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1f0)
/** CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH4_INT_MAP_S  0

/** CORE1_H264_DMA2D_IN_CH5_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_DMA2D_IN_CH5_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1f4)
/** CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_M  (CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_V << CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_S)
#define CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_DMA2D_IN_CH5_INT_MAP_S  0

