espressif/esp-idf/components/soc/esp32p4/include/soc/core1_interrupt_reg.h
/** CORE1_H264_REG_INT_MAP_REG register
 *  NA
 */
#define CORE1_H264_REG_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1f8)
/** CORE1_CORE1_H264_REG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_H264_REG_INT_MAP    0x0000003FU
#define CORE1_CORE1_H264_REG_INT_MAP_M  (CORE1_CORE1_H264_REG_INT_MAP_V << CORE1_CORE1_H264_REG_INT_MAP_S)
#define CORE1_CORE1_H264_REG_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_H264_REG_INT_MAP_S  0

/** CORE1_ASSIST_DEBUG_INT_MAP_REG register
 *  NA
 */
#define CORE1_ASSIST_DEBUG_INT_MAP_REG (DR_REG_CORE1_BASE + 0x1fc)
/** CORE1_CORE1_ASSIST_DEBUG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_ASSIST_DEBUG_INT_MAP    0x0000003FU
#define CORE1_CORE1_ASSIST_DEBUG_INT_MAP_M  (CORE1_CORE1_ASSIST_DEBUG_INT_MAP_V << CORE1_CORE1_ASSIST_DEBUG_INT_MAP_S)
#define CORE1_CORE1_ASSIST_DEBUG_INT_MAP_V  0x0000003FU
#define CORE1_CORE1_ASSIST_DEBUG_INT_MAP_S  0

/** CORE1_INTR_STATUS_REG_0_REG register
 *  NA
 */
#define CORE1_INTR_STATUS_REG_0_REG (DR_REG_CORE1_BASE + 0x200)
/** CORE1_CORE1_INTR_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_INTR_STATUS_0    0xFFFFFFFFU
#define CORE1_CORE1_INTR_STATUS_0_M  (CORE1_CORE1_INTR_STATUS_0_V << CORE1_CORE1_INTR_STATUS_0_S)
#define CORE1_CORE1_INTR_STATUS_0_V  0xFFFFFFFFU
#define CORE1_CORE1_INTR_STATUS_0_S  0

/** CORE1_INTR_STATUS_REG_1_REG register
 *  NA
 */
#define CORE1_INTR_STATUS_REG_1_REG (DR_REG_CORE1_BASE + 0x204)
/** CORE1_CORE1_INTR_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_INTR_STATUS_1    0xFFFFFFFFU
#define CORE1_CORE1_INTR_STATUS_1_M  (CORE1_CORE1_INTR_STATUS_1_V << CORE1_CORE1_INTR_STATUS_1_S)
#define CORE1_CORE1_INTR_STATUS_1_V  0xFFFFFFFFU
#define CORE1_CORE1_INTR_STATUS_1_S  0

/** CORE1_INTR_STATUS_REG_2_REG register
 *  NA
 */
#define CORE1_INTR_STATUS_REG_2_REG (DR_REG_CORE1_BASE + 0x208)
/** CORE1_CORE1_INTR_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_INTR_STATUS_2    0xFFFFFFFFU
#define CORE1_CORE1_INTR_STATUS_2_M  (CORE1_CORE1_INTR_STATUS_2_V << CORE1_CORE1_INTR_STATUS_2_S)
#define CORE1_CORE1_INTR_STATUS_2_V  0xFFFFFFFFU
#define CORE1_CORE1_INTR_STATUS_2_S  0

/** CORE1_INTR_STATUS_REG_3_REG register
 *  NA
 */
#define CORE1_INTR_STATUS_REG_3_REG (DR_REG_CORE1_BASE + 0x20c)
/** CORE1_CORE1_INTR_STATUS_3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define CORE1_CORE1_INTR_STATUS_3    0xFFFFFFFFU
#define CORE1_CORE1_INTR_STATUS_3_M  (CORE1_CORE1_INTR_STATUS_3_V << CORE1_CORE1_INTR_STATUS_3_S)
#define CORE1_CORE1_INTR_STATUS_3_V  0xFFFFFFFFU
#define CORE1_CORE1_INTR_STATUS_3_S  0

/** CORE1_CLOCK_GATE_REG register
 *  NA
 */
#define CORE1_CLOCK_GATE_REG (DR_REG_CORE1_BASE + 0x210)
/** CORE1_CORE1_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define CORE1_CORE1_REG_CLK_EN    (BIT(0))
#define CORE1_CORE1_REG_CLK_EN_M  (CORE1_CORE1_REG_CLK_EN_V << CORE1_CORE1_REG_CLK_EN_S)
#define CORE1_CORE1_REG_CLK_EN_V  0x00000001U
#define CORE1_CORE1_REG_CLK_EN_S  0

/** CORE1_INTERRUPT_REG_DATE_REG register
 *  NA
 */
#define CORE1_INTERRUPT_REG_DATE_REG (DR_REG_CORE1_BASE + 0x3fc)
/** CORE1_CORE1_INTERRUPT_REG_DATE : R/W; bitpos: [27:0]; default: 33566752;
 *  NA
 */
#define CORE1_CORE1_INTERRUPT_REG_DATE    0x0FFFFFFFU
#define CORE1_CORE1_INTERRUPT_REG_DATE_M  (CORE1_CORE1_INTERRUPT_REG_DATE_V << CORE1_CORE1_INTERRUPT_REG_DATE_S)
#define CORE1_CORE1_INTERRUPT_REG_DATE_V  0x0FFFFFFFU
#define CORE1_CORE1_INTERRUPT_REG_DATE_S  0

#ifdef __cplusplus
}
#endif
